# a代表变量名 =代表赋值
a=343456
print(type(a))
b='sdgdrdh'
print(type(b))
# ()表示tuple代表一个元组，可以存多个数据，多个数据中间用“，”隔开
c=(3,5,67,89,90)
print(type(c))
# 【】表示list代表一个列表，可以存多个数据，多个数据中间用“，”隔开
d=[35,56,78,98]
print(type(d))
# 键值对
e={"姓名":"宋丹阳","手机号":"158888888","性别":"女"}
print(type(e))
print(e)
#练习
# 第一组数据   张三,李四,王五,赵六,钱七
f=("张三","李四","王五","赵六","钱七")
print(type(f))
print(f)
# 第二组数据    姓名 张三  年龄 18 性别 女  科目 语文 成绩 80
f1={"姓名":"张三","年龄":"18","性别":"女","科目":"语文","成绩":"80"}
print(type(f1))
print(f1)
# 第三组数据   A，2,3,4,5,6,7,8,9，J,Q,K
f2=("A",2,3,4,5,6,7,8,9,"J","Q","K")
print(type(f2))
print(f2)
# 第四组数据  10000
F3=10000
print(F3)
# 第五组数据  学生
F4="学生"
print(F4)
# 小明有20块钱，红双喜10块钱，玉溪25块钱，大前门5块钱   求出小明可以买那种烟
r = 20
if(r>=10):
    print(r,"元能买红双喜")
if(r>=25):
    print(r,"元能买玉溪")
if(r>=5):
    print(r,"元能买大前门")
# 18岁以上成人票 200 18岁以下的小孩票100 60岁以上的老人票 150 小明今年18岁，去买票应该买那种票？
h = 18
if(h>=18):
    print(h,"买成人票,200元")
elif(h<18):
    print(h, "买小孩票,100元")
elif(h>=60):
    print(h, "买老人票,150元")
